### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # helm_release.onp_cluster_argo_apps will be created
+   resource "helm_release" "onp_cluster_argo_apps" {
+       atomic                     = false
+       chart                      = "argocd-apps"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argocd-apps"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = true
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = true
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                # Config values for the ArgoCD Helm Chart.
                # For default values, see
                # https://raw.githubusercontent.com/argoproj/argo-helm/798c8107c3d0015b8cb93d565cf714c16848b3e8/charts/argocd-apps/values.yaml
                applications:
-                   name: argocd-root-app-of-apps
                    namespace: argocd
                    project: argocd-root
                    source:
                      repoURL: https://github.com/GiganticMinecraft/seichi_infra
                      targetRevision: main
                      path: seichi-onp-k8s/manifests/seichi-kubernetes/apps/root
                      directory:
                        recurse: true
                    finalizers:
-                     resources-finalizer.argocd.argoproj.io
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: argocd
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                        allowEmpty: true
                      syncOptions:
-                         CreateNamespace=true
                      retry:
                        limit: -1
                        backoff:
                          duration: 5s
                          factor: 2
                          maxDuration: 2m
                
                projects:
-                   name: argocd-root
                    namespace: argocd
                    finalizers:
-                     resources-finalizer.argocd.argoproj.io
                    description: The top-level project
                    sourceRepos:
-                       "*"
                    destinations:
-                       namespace: "*"
                        server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
-                       group: "*"
                        kind: "*"
            EOT,
        ]
+       verify                     = false
+       version                    = "0.0.1"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.onp_cluster_argocd will be updated in-place
!   resource "helm_release" "onp_cluster_argocd" {
        id                         = "argocd"
        name                       = "argocd"
!       version                    = "5.0.0" -> "5.4.2"
        # (27 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>